In [92]:
import numpy as np
import pandas as pd

In [93]:
credits = pd.read_csv('datasets/credits.csv')

In [94]:
credits.head(1)

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)', 'credit_id': '52fe4284c3...","[{'credit_id': '52fe4284c3a36847f8024f49', 'department': 'Directing', '...",862

In [95]:
meta = pd.read_csv('datasets/movies_metadata.csv')

C:\Users\palak\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [96]:
meta.head(1)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', 'poster_path': '/7G9915Lf...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, 'name': 'Comedy'}, {'id': ...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his room until Andy's birthda...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0

In [97]:
meta['release_date'] = pd.to_datetime(meta['release_date'], errors='coerce')

In [98]:
meta['year'] = meta['release_date'].dt.year

In [99]:
# Count of movies released every year

meta['year'].value_counts().sort_index()

1874.0       1
1878.0       1
1883.0       1
1887.0       1
1888.0       2
          ...
2015.0    1905
2016.0    1604
2017.0     532
2018.0       5
2020.0       1
Name: year, Length: 135, dtype: int64

In [100]:
# Extracting only 2017 movies from this file
# Remaining will be obtained in the next file

new_meta = meta.loc[meta.year == 2017,['genres','id','title','year']]

In [101]:
new_meta.head(1)

,genres,id,title,year
26560,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, 'name': 'Action'}, {'id': ...",166426,Pirates of the Caribbean: Dead Men Tell No Tales,2017.0

In [102]:
new_meta['id'] = new_meta['id'].astype(int)

In [103]:
# Merging new_meta and credits on the basis of id

data = pd.merge(new_meta, credits, on='id')

In [104]:
pd.set_option('display.max_colwidth', 75)
data.head(1)

,genres,id,title,year,cast,crew
0,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, 'name': 'Action'}, {'id': ...",166426,Pirates of the Caribbean: Dead Men Tell No Tales,2017.0,"[{'cast_id': 1, 'character': 'Captain Jack Sparrow', 'credit_id': '52fe...","[{'credit_id': '52fe4c9cc3a36847f8236a65', 'department': 'Production', ..."

In [105]:
# Converting string to list

import ast

data['genres'] = data['genres'].map(lambda x: ast.literal_eval(x))
data['cast'] = data['cast'].map(lambda x: ast.literal_eval(x))
data['crew'] = data['crew'].map(lambda x: ast.literal_eval(x))

In [106]:
data.head(1)

,genres,id,title,year,cast,crew
0,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, 'name': 'Action'}, {'id': ...",166426,Pirates of the Caribbean: Dead Men Tell No Tales,2017.0,"[{'cast_id': 1, 'character': 'Captain Jack Sparrow', 'credit_id': '52fe...","[{'credit_id': '52fe4c9cc3a36847f8236a65', 'department': 'Production', ..."

In [107]:
# Extracting only genres for a particular movie and appending it to a list

def genresList(x):
    gen = []
    st = " "
    for i in x:
        if i.get('name') == 'Science Fiction':
            scifi = 'Sci-Fi'
            gen.append(scifi)
        else:
            gen.append(i.get('name'))
    if gen == []:
        return np.NaN
    else:
        return (st.join(gen))

In [108]:
data['genresList'] = data['genres'].map(lambda x: genresList(x))

In [109]:
data['genresList']

0      Adventure Action Fantasy Comedy
1      Action Adventure Fantasy Sci-Fi
2      Action Adventure Fantasy Sci-Fi
3       Action Adventure Comedy Sci-Fi
4             Fantasy Action Adventure
                    ...
526                     Romance Comedy
527         Crime Comedy Action Family
528    Family Animation Romance Comedy
529               Crime Drama Thriller
530                                NaN
Name: genresList, Length: 531, dtype: object

In [110]:
# Extracting cast name and appending it to a list

def getActor1(x):
    casts = []
    for i in x:
        casts.append(i.get('name'))
    if casts == []:
        return np.NaN
    else:
        return (casts[0])

In [111]:
data['actor_1_name'] = data['cast'].map(lambda x: getActor1(x))

In [112]:
# Extracting cast and appending it to a list

def getActor2(x):
    casts = []
    for i in x:
        casts.append(i.get('name'))
    if casts == [] or len(casts)<=1:
        return np.NaN
    else:
        return (casts[1])

In [113]:
data['actor_2_name'] = data['cast'].map(lambda x: getActor2(x))

In [114]:
# Extracting cast and appending it to a list

def getActor3(x):
    casts = []
    for i in x:
        casts.append(i.get('name'))
    if casts == [] or len(casts)<=2:
        return np.NaN
    else:
        return (casts[2])

In [115]:
data['actor_3_name'] = data['cast'].map(lambda x: getActor3(x))

In [116]:
data[['actor_1_name', 'actor_2_name', 'actor_3_name']]

             actor_1_name    actor_2_name     actor_3_name
0             Johnny Depp   Javier Bardem    Geoffrey Rush
1             Ben Affleck    Henry Cavill        Gal Gadot
2         Chris Hemsworth  Tom Hiddleston   Cate Blanchett
3             Chris Pratt     Zoe Saldana    Dave Bautista
4          Pierce Brosnan    William Hurt  Benjamin Walker
..                    ...             ...              ...
526        Inka HaapamÃ¤ki   Rosa Honkonen   Tiitus Rantala
527  Lou Diamond Phillips   Wallace Shawn      Gina Holden
528                   NaN             NaN              NaN
529        Sridevi Kapoor       Sajal Ali   Akshaye Khanna
530                   NaN             NaN              NaN

[531 rows x 3 columns]

In [117]:
#Extracting director from crew

def getDirectors(x):
    dt = []
    st = " "
    for i in x:
        if i.get('job') == 'Director':
            dt.append(i.get('name'))
    if dt == []:
        return np.NaN
    else:
        return (st.join(dt))

In [118]:
data['director_name'] = data['crew'].map(lambda x: getDirectors(x))

In [119]:
data['director_name']

0      Joachim RÃ¸nning Espen Sandberg
1                         Zack Snyder
2                       Taika Waititi
3                          James Gunn
4                       Sean McNamara
                    ...
526                  Hannaleena Hauru
527             Jonathan A. Rosenbaum
528          Beth David Esteban Bravo
529                      Ravi Udyawar
530                     Daisy Asquith
Name: director_name, Length: 531, dtype: object

In [120]:
# Shifting all the required fields to movie dataframe

movie = data.loc[:, ['director_name','actor_1_name','actor_2_name','actor_3_name','genresList','title']]

In [121]:
movie.head(1)

,director_name,actor_1_name,actor_2_name,actor_3_name,genresList,title
0,Joachim RÃ¸nning Espen Sandberg,Johnny Depp,Javier Bardem,Geoffrey Rush,Adventure Action Fantasy Comedy,Pirates of the Caribbean: Dead Men Tell No Tales

In [122]:
movie.isna().sum()

director_name     4
actor_1_name     22
actor_2_name     55
actor_3_name     70
genresList        7
title             0
dtype: int64

In [123]:
movie = movie.dropna(how='any')

In [124]:
movie.isna().sum()

director_name    0
actor_1_name     0
actor_2_name     0
actor_3_name     0
genresList       0
title            0
dtype: int64

In [125]:
movie = movie.rename(columns={'genresList':'genres'})
movie = movie.rename(columns={'title':'movie_title'})

In [126]:
movie['movie_title'] = movie['movie_title'].str.lower()

In [127]:
movie['comb'] = movie['actor_1_name'] + ' ' + movie['actor_2_name'] + ' '+ movie['actor_3_name'] + ' '+ movie['director_name'] +' ' + movie['genres']

In [128]:
movie.head(1)

,director_name,actor_1_name,actor_2_name,actor_3_name,genres,movie_title,comb
0,Joachim RÃ¸nning Espen Sandberg,Johnny Depp,Javier Bardem,Geoffrey Rush,Adventure Action Fantasy Comedy,pirates of the caribbean: dead men tell no tales,Johnny Depp Javier Bardem Geoffrey Rush Joachim RÃ¸nning Espen Sandberg ...

In [129]:
old = pd.read_csv('datasets/data.csv')

In [130]:
old.head(1)

,director_name,actor_1_name,actor_2_name,actor_3_name,genres,movie_title
0,James Cameron,CCH Pounder,Joel David Moore,Wes Studi,Action Adventure Fantasy Sci-Fi,avatar

In [131]:
old['comb'] = old['actor_1_name'] + ' ' + old['actor_2_name'] + ' '+ old['actor_3_name'] + ' '+ old['director_name'] +' ' + old['genres']

In [132]:
old.head(1)

,director_name,actor_1_name,actor_2_name,actor_3_name,genres,movie_title,comb
0,James Cameron,CCH Pounder,Joel David Moore,Wes Studi,Action Adventure Fantasy Sci-Fi,avatar,CCH Pounder Joel David Moore Wes Studi James Cameron Action Adventure F...

In [133]:
# Appending both the datasets into new

new = old.append(movie)

In [134]:
new.head(1)

,director_name,actor_1_name,actor_2_name,actor_3_name,genres,movie_title,comb
0,James Cameron,CCH Pounder,Joel David Moore,Wes Studi,Action Adventure Fantasy Sci-Fi,avatar,CCH Pounder Joel David Moore Wes Studi James Cameron Action Adventure F...

In [135]:
new.drop_duplicates(subset ="movie_title", keep = 'last', inplace = True)

In [136]:
new.head(1)

,director_name,actor_1_name,actor_2_name,actor_3_name,genres,movie_title,comb
0,James Cameron,CCH Pounder,Joel David Moore,Wes Studi,Action Adventure Fantasy Sci-Fi,avatar,CCH Pounder Joel David Moore Wes Studi James Cameron Action Adventure F...

In [137]:
new.to_csv('new_data.csv',index=False)